20251230
修复缓存引起的问题

20251230
新增我的优囍
更新go代理支持多线程文件下载
修复凯速兼容安卓6
 
20251227
新增阿里云盘支持
聚合短剧移除碎片平台，新增软鸭
新增瓜子

20251225
修复围观短剧，清理无用代码
恢复本地数据库直链播放
修复本地数据库默认路径
20251224
修复斗鱼
优化本地数据库播放，调用推送播放数据库链接
新增KTV，需要在配置中心网络数据数据先下载KTV数据库

20251221
修复go代理压缩导致Bad system call
修复聚合短剧，无法显示更多页面，新增筛选
新增凯速远程扫描输入token，方便电视端输入
优化同步凯速云端cookie
修复无法自定义块大小
新增ABI手动选择器，在配置中心
优化go引擎状态探测显示

20251217
凯速备份优化
go代理尝试支持32位安卓9盒子
新增聚合短剧

20251216
商店APK下载优化
代理地址优化
配置中心和商店去掉推荐
实现本地包在线更新
实现github工作流自动打包本地包并发布


20251215
实现备份本地目录/storage/emulated/0/TVData/cookie/下面的cookie到凯速/TVData/cookie/
实现下载凯速/TVData/cookie/目录的cookie到本地目录/storage/emulated/0/TVData/cookie/

20251214
在线接口走网络，本地包走本地，智能判断
实现本地包，可以放置在任意目录

20251127
修复百度网盘推送
隐藏不稳定站点飞快，跨社
优化夸克自动清理
修复夸克播自己分享的

20251127
优化GO代理
统一cookie路径命名项目结构更清晰
优化性能

20251127
打包优化
二进制API23 安卓6
修复无法动态覆盖旧二进制

20251126
修复123登录
修复123登录持久化
新增网盘多线程自定义配置
修复百度播自己分享的
修复百度路径不存在时创建大量垃圾目录
